[
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/ee-uk-launches-new-mobile-smartphone-plans-for-under-18s.html",
        "date": "29-07-2025",
        "title": "EE UK Launches New Mobile Smartphone Plans for Under 18s",
        "cleaned_text": "Broadband and mobile operator EE ( BT ) has today responded to the UK government’s drive to wrap everybody under the age of 18 in cotton wool by becoming the “ first major network ” to launch a dedicated Smartphone proposition (mobile plans) for U18s, called “ Safer SIMs ” – part of its commitment toward “ being the UK’s best network for families “. The new plans are designed with network level website content controls, scam call protection, spending caps and “ Stay Connected Data ” – the latter allows you to stay online after you’ve used up all your data, albeit at a speed of 0.5Mbps (already a normal feature on a lot of EE ’s mobile plans). Safer SIM plans are available on any smartphone device and are being supported by the option of new in-store online safety appointments with trained guides available in over 400 EE retail stores. The guides will work to provide “ online safety support and practical guidance to parents and carers, as well as advice on setting-up device level controls “. Advertisement The new initiatives come as a new study conducted for EE by Opinium claims to have found that only 52% of parents feel they have the right tools and guidance to manage their child’s smartphone and social media usage, and 78% of children admit they conceal some of their online activity from their parents (aka – privacy). A total of three new 30-day “ Safer ” SIM-only plans are due to launch “ next month “, which will be tiered with different levels of controls and start from £7 per month. Safer SIM Plans Protected Plan : Ideal for the first few years of secondary school, with strict mobile network content controls when accessing websites, unlimited calls/texts with premium numbers, 150 text services and charge to plan blocked, reduced speeds (0.5Mbps) to limit streaming, as well as scam call protect Guided Plan: Supports growing independence, and ideal for early teenage years with moderate mobile network content controls when accessing websites, 3GB data at 10Mbps, unlimited calls/texts with premium numbers, 150 text services and charge to plan blocked, and scam call protect. A pay-as-you-go version of the Guided Plan will also be available at launch Trusted Plan: Ideal for older teenagers, with moderate mobile network content controls when accessing websites, 10GB data at 100Mbps, unlimited calls/texts with premium numbers, 150 text services and charge to plan blocked, and scam call protect EE is also launching The P.H.O.N.E Chat , a content resource created to help parents explain the responsibility of smartphone ownership. This guide has been designed with support from Internet Matters, children, and their parents, to aid conversations about owning a phone, and includes details of how to talk about using their first handset. This is already available online, and in-store in the coming weeks. Claire Gillies, CEO at BT Group’s Consumer Division, said: “As the UK’s best network for families, we understand that while smartphones offer many benefits to people, there are also very real risks and challenges, especially for young people. As a parent of a teenager, I too have had to balance the benefits and challenges that come with giving our children their first smartphone. I am proud that EE has consistently been an industry leader for online safety and today’s announcement is yet another example of our commitment to providing helpful tools and guidance to families. Our new initiatives and resources are there for parents at every stage of their child’s adolescence, so they can safely and confidently make the choice about smartphone usage that is right for them and their family”. We should point out that the big mobile operators already offer network-level content filtering controls and tech-savvy parents will no doubt already be able to figure out how to setup a Smartphone to be safe for their children, without needing to take out a special mobile plan. But clearly that knowledge isn’t going to be universal and this is where EE’s new plans may help to simplify. Advertisement However, we can’t help but think that the government’s root and branch approach to introducing age-based restrictions (verification) across the internet is both needlessly excessive (it’s impacting all sorts or regular services and messaging systems) and easily defeatable (VPN). Not to mention the notion of treating young adults aged 15-18 in roughly the same way as much younger children is a touch insulting for people in that age group. NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/bt-completes-refund-of-18m-to-uk-customers-over-contract-failings.html",
        "date": "29-07-2025",
        "title": "BT Completes Refund of £18m to UK Customers Over Contract Failings",
        "cleaned_text": "The telecoms regulator has today revealed that UK broadband ISP and phone giant BT (inc. EE and Plusnet ) have now refunded or credited £18m back to customers. This follows last year’s Ofcom ruling ( here ), which found that the provider had “ failed to provide ” 1.1 million customers with clear and simple contract information before signing up to a new deal. Just to recap. Since June 2022 broadband and mobile operators have been required to provide customers with a short, one-page summary of the main contract terms of their chosen package before entering into a contract, including clear examples of how any price increases might impact the price they pay. But Ofcom ’s investigation found that EE and Plusnet had failed to do this for a sizeable number of customers and fined BT £2.8m. As well as fining BT, Ofcom also required the provider to amend its sales process and refund any affected customers who may have been charged for leaving before the end of their contract period. “ We told the company that if it was unable to refund any money, it must donate it to charity ,” said the regulator. Advertisement As a result of this enforcement action, Ofcom has today posted a brief after action report that reveals how BT has now refunded or credited £18 million back to customers and donated £440,000 across 17 charities where refunds or credits were not possible. Ofcom Statement The company broke our consumer protection rules designed to ensure telecoms customers get clear, comparable information about the services they are considering buying. Following engagement with Ofcom, BT contacted the majority of affected customers, explaining that it had not provided them with the information to which they were entitled, and giving them the opportunity to request the information and/or cancel their contract without charge. However, before these communications were sent, some customers affected by the breach left BT before the end of their contract and may have been charged an early exit fee. Our rules are clear that if the required contract summary and contract information is not given, the contract is not binding on customers. As a result, an early exit fee should not have been payable by these customers. As well as fining BT, we also required it to amend its sales process and refund any affected customers who may have been charged for leaving before the end of their contract period. We told the company that if it was unable to refund any money, it must donate it to charity. As a result of this enforcement action, BT has now refunded or credited £18 million back to customers and donated £440,000 across 17 charities where refunds or credits were not possible. NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/o2-uk-boost-4g-and-5g-mobile-at-700-postcodes-in-dundee-scotland.html",
        "date": "29-07-2025",
        "title": "O2 UK Boost 4G and 5G Mobile at 700 Postcodes in Dundee, Scotland",
        "cleaned_text": "Mobile network operator O2 ( Virgin Media ) has today announced that they’ve completed a project to upgrade the network capacity and coverage of their 4G and 5G mobile (mobile broadband) services around a total of 700 postcodes across the coastal Scottish city of Dundee on the Firth of Tay estuary. The upgrades, which took 12 months to deploy, form part of O2 ’s Mobile Transformation Plan , which is investing around £700m this year into their mobile network – “ ensuring it is fit for the future and can keep up with increasing customer demand “. All mobile network operators have to conduct similar work, so this is not unusual and comes against a backdrop of rising demand (i.e. the amount of mobile data traffic more than doubling on O2’s network in the past 5 years). Not to mention the need to withdraw their old 3G network. Sadly that’s all the information we get. Advertisement NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/gofibre-begins-fttp-broadband-build-in-witton-le-wear-county-durham.html",
        "date": "29-07-2025",
        "title": "GoFibre Extends FTTP Broadband Build to Witton-le-Wear, County Durham",
        "cleaned_text": "Edinburgh-based UK broadband provider GoFibre has today announced that they’ve begun to expand their new full fibre ( FTTP ) network into the rural village of Witton-le-Wear in County Durham. The build forms part of their state aid supported Project Gigabit contract with the government. Just to recap. The Government’s £5bn Project Gigabit scheme is currently working to extend 1Gbps download speeds (200Mbps+ uploads) to reach “ nationwide ” coverage (c. 99%) by around 2032. As part of that, GoFibre has already secured three smaller ‘Local’ (Type A) deployment contracts for Teesdale (Lot 4.01), North Northumberland (Lot 34.01) and the Scottish Borders and East Lothian (Scotland Lot 5) area. On top of that, they also hold the £105m regional (Type B) contract for North East Scotland . NOTE: GoFibre is supported by an investment of £164m from Gresham House ( here ). The operator has so far covered over 120,000 premises (RFS) across over 30 “ local areas ” in Scotland and the North of England. The deployment in Witton-le-Wear thus forms part of their Teesdale (County Durham) contract and GoFibre’s network has already reached around 150 homes and businesses in the community, with a further 118 premises due to be added before build completion is reached in August 2025. Since commencing the wider project, over 4,000 funded premises are now ready for connection in the Durham-Teesdale contract area (close to the original target for Lot 4.01). Advertisement Despite a challenging crossing of the Witton Bridge which required the use of civil engineering avoidance techniques to avoid impacting the Grade 2 listed structure, the build has run to schedule so far. Andy Hepburn, COO of GoFibre, said: “We’d like to say a huge thank you to the local community for their support and patience throughout the build. Their cooperation allowed us to complete the project with minimal disruption, particularly when working around the historic Witton Bridge. We know firsthand how frustrating poor internet can be, so it’s incredibly rewarding to deliver a service that’s fast, reliable, and built to last. This is a proud moment for our team and for the community. We hope you can join us at our event on the 12th to celebrate and learn how full fibre broadband can transform your online experience.” Customers of the new GoFibre service, once live over the next few years, can expect to pay from £22.50 per month for a 150Mbps (30Mbps upload) package on a 24-month term with an included wireless router, which rises to £33 for their top 1000Mbps (100Mbps upload) plan. The latter also comes with a bonus Wi-Fi extender (this can optionally be taken on other plans at extra cost). NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/netomnia-to-expand-wholesale-fttp-broadband-to-more-uk-isps-as-new-md-appointed.html",
        "date": "29-07-2025",
        "title": "Netomnia to Expand Wholesale FTTP Broadband to More UK ISPs as New MD Appointed",
        "cleaned_text": "Network operator Netomnia ( Brsk , Youfibre ), which has so far rolled out their Fibre-to-the-Premises ( FTTP ) broadband network to cover 2.56 million UK homes (inc. 341,000 customers), has appointed industry veteran Matthew Skipsey to be its new Managing Director (MD) of wholesale ahead of an expected adoption by more ISPs. At present Netomnia (Substantial Group), which recently became the first network operator to adopt 50Gbps (50G -PON) broadband technology ( here ), is aiming to expand the reach of their full fibre network to 3 million premises by the end of 2025 and then 5 million by the end of 2027 (inc. 1 million customers by 2028). The service is currently available across parts of over 90 UK cities and towns. NOTE: The combined group of Netomnia and Brsk is backed by around £1.5bn of equity and debt from investors Advencap, DigitalBridge, and Soho Square Capital etc. However, in terms of wholesale, the company has so far tended to remain a bit more vertically integrated by only selling packages to consumers and businesses via ISPs that are a part of the same group ( Youfibre and Brsk ). But ISPreview are now aware of several third-party retail ISPs that will imminently be joining this network as Netomnia moves to grow their focus on wholesale. Advertisement The latest sign of all this stems from the company’s decision to appoint industry veteran Matthew Skipsey to be their new MD of Wholesale. Matthew was previously the Network Strategy Director at All Points Fibre Networks (APFN) and the Co-founder, CTO & Head of Giganet before that. Going back further, he also helped to found Wessex Internet and held various senior positions at M12 Solutions. Matthew Skipsey said: “I’m delighted to join Netomnia as Managing Director of Wholesale. I’ve always respected Netomnia and the wider Substantial Group companies. They continue to achieve some impressive numbers; including a capital-efficient build programme, fastest Alt-Net build and subscriber acquisition rate, powerful network and proudly are the second-largest Alt-Net in the UK. None of this would be possible without the exceptional people behind it. I’m excited to lead Netomnia’s Wholesale division, which provides open access to Netomnia’s 2.56+ million premises for B2C & B2B full-fibre broadband, Ethernet and dark fibre opportunities. The network is on track to reach 3 million premises by the end of 2025, with plans to scale to 5 million by 2027. I’d like to thank my ex colleagues at APFN, Fern Fibre, Octopus Investments and those from the original Giganet , M12, and Wessex Internet days as well as key suppliers who have supported me throughout my career in telecoms. The next chapter will be very exciting and I can’t wait to get started!” A stronger push into wholesale makes sense for an alternative network operator in Netomnia’s position, although its ability to break into this market may be constrained so long as it also continues to act as a competitor to its own future partners by running its own retail providers alongside them (conflict of interest). On the other hand, the operator’s growing network coverage and blistering speeds will be very attractive to a lot of ISPs. At this stage we don’t yet know how much flexibility third-party ISPs on this network will have to differentiate their products from that of the existing group providers, but we suspect that the prices and package speeds will initially be similar to those offered by Youfibre and brsk. NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/broadband-and-phone-provider-kcom-bids-farewell-to-ceo-tim-shaw.html",
        "date": "29-07-2025",
        "title": "Broadband and Phone Provider KCOM Bids Farewell to CEO Tim Shaw",
        "cleaned_text": "Hull-based UK network operator KCOM , which has deployed their own Fibre-to-the-Premises ( FTTP ) broadband network across a big chunk of East Yorkshire and Lincolnshire (England), has announced that current Chief Executive Officer (CEO), Tim Shaw, is to step down. The outgoing CEO will hand over the reins to CFO Richard Schäfer on an interim basis. Tim has been with the Macquarie-backed business for six and a half years, albeit only three years as its CEO. During that time he’s witnessed the continued expansion of their FTTP network, as well as the ongoing migration and retirement of their old copper line network. On the flip side, he’s also seen KCOM ’s grip on its core market of Hull being eroded by rivals, such as Connexin ( CityFibre ) and MS3 , and the operator has recently been nudged to embrace infrastructure sharing ( here ). NOTE: KCOM’s full fibre network now reaches 305,000 premises and the operator is still deemed by Ofcom to hold Significant Market Power (SMP) in the Hull area, although this is due to be reviewed. The announcement itself doesn’t say why Tim has chosen to leave, although we understand that he’ll be announcing his next move in due course (i.e. it sounds like he’ll be taking up a new role elsewhere). KCOM is clearly facing some challenges, not least from Ofcom ’s forthcoming market review and its weakening hold over local infrastructure, thus the company might benefit from a fresh pair of hands and a new vision for the business. Advertisement Richard Greenleaf, Chair of KCOM, said: “Our huge thanks go to Tim. He has led KCOM through a period of significant change, both for the business and in the wider UK telco market; throughout this, he has always kept the customer and service innovation at the heart of what we do. We wish him the very best for his next chapter.” Tim Shaw, CEO of KCOM, said: “Over the past four years, KCOM has been through some remarkable change. I’m immensely proud of the way the team has focused relentlessly on customer experience, embraced innovation and taken connectivity to even more homes in the region. KCOM is an iconic brand, and leading the business through its 120th anniversary last year was one of the great privileges of my role.” A recruitment process for a permanent appointment is currently underway, led by the Board. NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "ISPreview",
        "url": "https://www.ispreview.co.uk/index.php/2025/07/gov-update-on-plan-to-help-push-fttp-broadband-into-uk-flats-and-build-mobile-masts.html",
        "date": "29-07-2025",
        "title": "Gov Update on Plan to Help Push FTTP Broadband into UK Flats and Build Mobile Masts",
        "cleaned_text": "The Telecoms Minister, Sir Chris Bryant, recently issued an important update on their efforts to boost growth by removing barriers to digital infrastructure deployment. The statement covered progress with flexi-permits and softening the rules for new mobile masts, but it also touched on how they intend to help get gigabit broadband into large residential buildings (blocks of flats / apartments). The government’s recent 2025 Spending Review and 10-Year Infrastructure Strategy have already touched on some of the above topics. But Bryant’s latest statement also managed to add a few details about the Government’s plans that we hadn’t seen before. NOTE: c.88% of the UK can already access “ gigabit-capable broadband ” – mostly thanks to commercial builds ( here ). At the same time, geographic 4G mobile coverage stands at around 88-90% ( here ) and outdoor coverage of 5G premises is 62-85% (rising to 92-96% from at least one operator). For example, on the issue of adopting a more flexible permitting system ( flexi-permits ) for broadband related street works across England, Bryant said they expect to see the results from the evaluation of their most recent trial of this system in October 2025. Advertisement “ Should that demonstrate positive results, we will promptly consult on the necessary legislative changes ,” said the minister. Flexi permits mean that network builders can apply to local authorities for a single permit covering a wide geographical area, instead of numerous separate street applications. Separately, mobile operators have long been pushing the government to make further changes in order to make it easier for them to deploy new mobile masts ( here , here , here , here , here and here ), albeit so far with only limited success. But Bryant said he would shortly publish a Call for Evidence on Permitted Development (PD) rights “ as soon as possible “, which may “ enable faster deployment ” in the future. Finally, Bryant also touched on the government’s approach to making it easier to deploy gigabit broadband into large residential buildings (blocks of flats / MDUs), particularly those where such deployments have been unreasonably refused or landlords cannot be contacted. The government recently rejected an amendment about this in the Renters’ Rights Bill ( here ), although at the time they did pledge to examine what other interventions might be possible and Bryant said they plan to consult on related measures by the autumn. Advertisement The details on the above as still wafer thin, but the plans seem to be focused on creating a “ new right for leaseholders to request a gigabit broadband connection and a duty for freeholders not to unreasonably refuse the request “. Sir Chris Bryant said: “To overcome barriers to deployment of gigabit-capable infrastructure in blocks of flats, we will consult on measures by the autumn to create a new right for leaseholders to request a gigabit broadband connection and a duty for freeholders not to unreasonably refuse the request. Working closely with the Ministry of Housing, Communities and Local Government, we would seek to legislate for any resulting measures when parliamentary time allows. Work is underway to ensure that delays arising from the higher risk building safety regime are addressed as soon as possible. We are working closely with the telecoms sector to understand the scale of the impact on telecoms deployment specifically, alongside developing appropriate remedies which will support the continued investment and rollout of 5G and gigabit broadband while upholding the government’s commitment to building safety. We will accelerate the rollout of gigabit-capable broadband by tackling barriers to the deployment of underground broadband infrastructure. We have trialled the use of flexi-permits for street works and will see the results of the evaluation in October. Should that demonstrate positive results, we will promptly consult on the necessary legislative changes. We will consider areas where planning laws and guidance might be changed to facilitate the deployment of mobile masts. To that end, we will publish a call for evidence on Permitted Development Rights as soon as possible. Subject to feedback received, any resulting measures designed to enable faster deployment of telecommunications infrastructure will be implemented as quickly as possible.” All of the proposed measures are likely to have their detractors, particularly those within local communities who always object to new masts for a variety of reasons (visual impact, unsubstantiated health fears etc.). Similarly, on the subject of flats/apartments, property owners will also have concerns that must be balanced in all this (i.e. insurance, conflicts with existing exclusivity agreements, damage to property, security, safety [e.g. fire, asbestos] and other liabilities etc.). Sometimes upgrading copper lines to fibre in MDUs (Multi-Dwelling Units) is a bit more involved than it may first seem. Equally, some alternative networks would be concerned about any changes that might give Openreach an unfair advantage in the market, while a few others MPs have already raised concerns that the changes might allow network operators to force their installation costs onto property owners. Advertisement Some supplier-neutral technology solutions do already exist in the market that claim to overcome the problem of tackling tricky MDUs. But it remains unclear whether the proposed changes might benefit or hinder those. NOTE: Your comment may not appear instantly (it may take several hours) due to static caching and moderation checks by the anti-spam system. Please be patient. We will reject comments that spam, troll, post via known fake IP/proxy servers or fall foul of our Online Safety and Content Policy ."
    },
    {
        "source": "Comms Business",
        "url": "https://www.commsbusiness.co.uk/content/news/zzoomm-s-hare-to-exit-business",
        "date": "29-07-2025",
        "title": "Zzoomm’s Hare to exit business",
        "cleaned_text": "Announcement follows FullFibre and Zzoomm merging their businesses earlier this year. Matthew Hare has announced he is leaving the merged business of FullFibre and Zzoomm. The announcement comes six months after FullFibre and Zzoomm announced the companies would merge . At the time, Matthew Hare, then CEO of Zzoomm (pictured above, left), was to become executive chairman and James Warner, then CEO of FullFibre (pictured above, right), was to become group CEO. The merger completed in March. Writing on LinkedIn, Hare said , “Although I am stepping back from the end of July 2025 from all day-to-day operations and my role as executive chairman, I remain a significant minority shareholder and wish the company every success in the future. “I am leaving the company in the hands of our capable and energetic CEO, James Warner. I am confident in James’ leadership and his ability to guide and motivate the management team that will take our company forward.” Prior to his role at Zzoomm, Hare was CEO of Gigaclear for seven years. Hare added he does not have any “immediate plans” and will be taking this summer to think about his future."
    },
    {
        "source": "Comms Business",
        "url": "https://www.commsbusiness.co.uk/content/news/ericsson-announces-completion-of-aduna-transaction",
        "date": "29-07-2025",
        "title": "Ericsson announces completion of Aduna transaction",
        "cleaned_text": "Aduna is now a 50:50 joint venture. 50 per cent is owned by Ericsson and 50 per cent is owned by twelve communications service providers (CSPs). Ericsson has confirmed the completion of the equity investments by twelve global communication service providers (CSPs) into its subsidiary Aduna. Aduna is now owned by AT&T, Bharti Airtel, Deutsche Telekom, Ericsson, KDDI, Orange, Reliance Jio, Singtel, Telefonica, Telstra, T-Mobile, Verizon and Vodafone. The deal was signed on 11 September 2024 and formally establishes Aduna as a 50:50 joint venture. Ericsson holds 50 percent of the venture equity, with the remaining 50 percent held by the above-named CSPs combined. Aduna was created to combine and sell aggregated network Application Programming Interfaces (APIs) globally. Ericsson contributed its global network platform, on which Aduna will build and refine its offering. The shareholders bring to Aduna funding and commercial agreements alongside support in the industry. That includes telecom operator relationships, knowledge of the developer community, and expertise in network APIs. Anthony Bartolo, CEO, Aduna, commented, “In just ten months we have built an impressive ecosystem comprising the biggest names in telecoms and the wider ICT industry. The closing provides renewed motivation for Aduna to accelerate the adoption of network APIs by developers on a global scale. “This includes encouraging more telecom operators to join the new company, further driving the industry and developer experience.” Aduna’s ecosystem includes technology and collaboration partnerships that span additional CSPs worldwide. To date these include: e&, Bouygues Telecom, Free, CelcomDigi, Softbank, NTT DOCOMO, Google Cloud, Vonage, Sinch, Infobip, Enstream, Bridge Alliance, Syniverse, JT Global, Microsoft, Wipro and Tech Mahindra."
    },
    {
        "source": "Comms Dealer",
        "url": "https://www.comms-dealer.com/financial-results/maintel-project-revenue-rises-20-transformation-continues",
        "date": "29-07-2025",
        "title": "Maintel project revenue rises 20% as transformation continues",
        "cleaned_text": "Maintel’s total revenue was £46.5m for the six months ended 30th June 2025, flat from the first half of 2024 (£46.6m), attributed to churned contracts offsetting a 20% growth in Project Revenue. Adjusted EBITDA was reported as £3.4m, down from £4.8m due to increased employer costs, investment in IT systems, marketing spends in H1 and a big contract win at the beginning of 2024. The report notes that Maintel’s planned cost mitigation activity, including reduced property related costs, continued transformation of the organisational model, as well as a comprehensive and ongoing procurement review, has begun in this half. It expects this to deliver £1.0m - £1.5m of cost savings in FY 2025 and annualised cost savings of £2.0m - £2.5m from FY 2026 onwards. Maintel states that its sales pipeline is the largest it has been for many years, climbing to £75m First Year Value at the end of June. It reads: “The Board remains focused on Maintel’s long-term growth strategy and believes that, following the Company’s transformation from a generalist managed service provider to a highly skilled specialist, the business is making good progress. “Such turnaround programmes take time, however the positive leading indicators, outlined in this update, demonstrate great progress and the Board is confident that these leading indicators will convert into improved financial results and increased shareholder value."
    },
    {
        "source": "Comms Dealer",
        "url": "https://www.comms-dealer.com/charity/sinnott-takes-ben-nevis-support-scotlands-para-gymnastics-squad",
        "date": "29-07-2025",
        "title": "Sinnott takes on Ben Nevis in support of Scotland’s Para Gymnastics Squad",
        "cleaned_text": "Iain Sinnott, CloudClevr’s Head of Group Customer Engagement, is taking on Ben Nevis on August 16th as part of a fundraising effort to send The City of Glasgow Para Gymnastics squad to Finland. This would be a key step in realising the squad’s ambitions to represent Great Britain in Brisbane 2032. Through the climb and other upcoming fundraising activities, Sinnott aims to fundraise £3000 to support athletes, coaches and carer travel, accommodation, kit, and competition fees. He said: “It's time to inspire a global generation of young people to use gymnastics to prove to themselves and to everyone else that barriers are all in the mind. By 2036 we want competition for a Paralympic gymnastics squad place to be a battle between thousands!” Alongside fundraising, Sinnott has taken the role of volunteer Director of the City of Glasgow Gymnastics Club (COGGC). He added: “I look forward to supporting the club’s mission to increase participation for all in the Glasgow area and, through the inspiring leadership of the disability sections coaches, spread the word across the country and Europe about Para-gymnastics and what it can do for the fitness, confidence and self-believe of young people with a physical disability.” To support these efforts visit: https://lnkd.in/eHmk5N4a Pictured: Sinnott and the ‘Kilted Climbers’ who will take on Ben Nevis"
    },
    {
        "source": "Comms Dealer",
        "url": "https://www.comms-dealer.com/comms-people/hibberd-joins-forge-sales-director",
        "date": "29-07-2025",
        "title": "Hibberd joins Forge as Sales Director",
        "cleaned_text": "Mark Hibberd has joined Forge Technologies as Sales Director to shape growth in the department’s team and strategy. He brings leadership experience and a deep understanding of strategic sales, having held roles at Ecko, Telefónica Tech and Cancom. He said: 'I will look to support our continued growth as we deliver differentiated digital experiences, harnessing data-driven insights, and modernising infrastructure for clients in the private and public sector.”"
    },
    {
        "source": "Comms Dealer",
        "url": "https://www.comms-dealer.com/financial-results/commsworld-boss-seeks-further-growth-revenues-grow",
        "date": "29-07-2025",
        "title": "Commsworld boss seeks further growth as revenues grow",
        "cleaned_text": "Commsworld’s total turnover has increased to £36.9m, up from £36.5m in 2023. Its pre-tax profit rose from £4.6m to £4.7m in the same period while EBITDA reached £7m, up from £6.6m. The companies fixed assets have risen by more than £5m to £22.3m, up from £17.1m last year. CEO Steve Langmead shares that the figures were broadly in line with the Commsworld Board’s expectations driven by contract wins in the the public and private sectors. Among them was a new contract worth more than £35m over five years to provide network services to Glasgow City Council and the completion of a projects with Northumberland County Council replacing its WAN and laying 262km of new full-fibre infrastructure. It cites another highlight as transforming the connectivity to 42 schools in and around Dundee as part of a £2.6m contract over 10 years with Dundee City Council. Langmead said: “Commsworld results show that the company is in very good health, and we are continuing to grow. Pre-tax profits and turnover have risen compared to 2023, showing that Commsworld has managed to absorb the impact of inflation on our business. “Future challenges include helping businesses and organisations through the PSTN shutdown, ensuring the withdrawal is managed in the best possible way to guarantee a smooth transition and minimal disruption. But our primary aim as a company is to continue to grow and evolve and win more big contracts.”"
    },
    {
        "source": "Comms Dealer",
        "url": "https://www.comms-dealer.com/comms-people/shaw-steps-back-kcom-helm",
        "date": "29-07-2025",
        "title": "Shaw steps back from KCOM helm",
        "cleaned_text": "Tim Shaw is stepping down as KCOM CEO after three years at the helm and six and a half years at the business. As CEO, Shaw oversaw the first phase of KCOM’s network expansion into new towns and villages and passed the 60% milestone of migration of customers off the copper network. He also oversaw the sale of the national business. He said: “I’m immensely proud of the way the team has focused relentlessly on customer experience, embraced innovation and taken connectivity to even more homes in the region.” He hands over the reins to CFO Richard Schäfer on an interim basis and a recruitment process for a permanent appointment is currently underway led by the Board. Richard Greenleaf, Chair of KCOM, added: “ Tim has led KCOM through a period of significant change, both for the business and in the wider UK telco market. We wish him the very best for his next chapter.”"
    },
    {
        "source": "Technology Reseller",
        "url": "https://technologyreseller.uk/it-teams-overconfident-in-resilience-as-outages-still-consume-a-quarter-of-their-time/",
        "date": "29-07-2025",
        "title": "IT teams overconfident in resilience as outages still consume a quarter of their time",
        "cleaned_text": "New SolarWinds report suggests IT leaders underestimate the impact of broken processes and limited staff SolarWinds , a leading provider of simple, powerful, secure observability and IT management software, today releases its 2025 IT Trends Report. While the findings show rising confidence in operational resilience, they also highlight that day-to-day issues continue to drain time and resources. Based on a survey of over 200 IT professionals across Europe, including the UK, the report shows that over half (55%) of European IT leaders consider their organisation resilient, though just one in three (34%) feel it’s ‘very resilient’. In the UK, 44% describe their organisation as resilient, while more than half (52%) feel ‘very resilient.’ Despite this optimism, the data suggests that much of this confidence could be superficial. In the UK, 44% of IT leaders spend a quarter of their working month resolving critical issues and service disruptions. Alarmingly, nearly a third (32%) report spending even more time, with an unlucky few saying up to 90% of their month is consumed by such problems. This highlights a clear disconnect between perceived confidence and the day-to-day reality of managing IT disruptions. Crucially, nearly half of participants point to cumbersome processes, rather than technology, as the biggest hurdle to stronger resilience. Almost half of UK IT pros (49%) blame internal processes during periods of disruption, while 39% state insufficient staffing as a key barrier to resilience. Commenting on these internal gaps between confidence and capability, Sascha Giese, tech evangelist at SolarWinds, said “This report confirms what we hear from our community and customers across the globe. Teams are dedicating real budget and effort to resilience, but many remain trapped in reactive mode. Technology alone cannot solve problems – it needs people with the knowledge and expertise, plus investment, to be able to succeed. Organisations must adopt new ways of working, in order to shift from firefighting to innovation, without compromising reliability.” Despite these hurdles, UK IT teams are taking a proactive approach and investing heavily in operational resilience. The majority (63%) report that up to 30% of their IT budget is now devoted to disruption prevention. Across Europe, more than two thirds (69%) are upgrading tools, training and playbooks to improve internal recovery and response processes for when disruptions occur. “In today’s competitive environment, operational resilience is no longer a nice-to-have but rather a strategic imperative,” added Cullen Childress, Chief Product Officer at SolarWinds. “Achieving it requires more than just adopting new technology. Organisations must equip their IT teams with the right tools, workflows, and talent to stay agile and responsive. When obstacles are removed and resilience is built into daily operations, IT becomes a true driver of competitive To explore the full findings from the 2025 IT Trends Report, “Fragile to Agile: The State of Operational Resilience”and learn how your organisation can build stronger operational resilience, download the report at: Learn more today at www.solarwinds.com . Please follow and like us: Please follow and like us: Author Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd Views: 29"
    },
    {
        "source": "Technology Reseller",
        "url": "https://technologyreseller.uk/whos-really-in-charge-over-half-of-uk-parents-say-their-children-outsmart-the-online-rules-they-set/",
        "date": "29-07-2025",
        "title": "Who’s Really in Charge: Over Half of UK Parents Say Their Children Outsmart the Online Rules They Set",
        "cleaned_text": "Norton report finds UK children turning to AI for emotional support, while cyberbullying continues to affect 1 in 8 children Norton , a global leader in consumer Cyber Safety and part of Gen , today published its 2025 Norton Cyber Safety Insights Report: Connected Kids , which reveals how children in the UK are one step ahead of their parents* online, dodging controls and accessing age-inappropriate content. Families now face a growing digital divide, where tech-savvy children are often navigating online spaces faster than the adults guiding them. The Digital Divide at Home Norton found that while 85% of parents in the UK actively manage screen time, the reality is many children are digitally skilled enough to sidestep the online rules set by their parents. Over half (53%) of parents say their child found a way to bypass screen time or online rules. Once past those boundaries, children are venturing into potentially risky territory, with 18% of UK parents reporting that they have caught their children accessing online content they thought they had blocked. Meanwhile, 12% caught their children watching explicit content and 11% reported incidents of their child sharing personal information with a stranger. As children continue to explore more of the online world on their own terms, the gap between what parents are comfortable with their children doing online and what they’re actually doing is wide. “Kids today are spending more time online than ever before, whether it’s for school, gaming, shopping, or connecting with friends. As parents, we want to make the world a better place for our kids – and that includes the digital world,” said Leyla Bilge, Global Head of Scam Research for Norton and mother of two. “Over 80% of cybercrime relies on emotional manipulation – and attackers don’t care what age you are. But the digital world doesn’t need to be a scary place. We are here to help empower parents with the knowledge and tools they need to help their children navigate the digital world safely.” Connected and Vulnerable Many UK parents are navigating the topic of cyberbullying with their children. The majority (91%) of parents in the UK say they feel comfortable discussing the topic with their children and 64% have had repeated conversations about online safety. Still, about one in eight parents (13%) report that their child has already been a victim of cyberbullying. Among those cases, more than half (53%) say the perpetrator was a stranger online, while over a third (36%) identified the bully as a classmate or peer. Worryingly, social media is a dominant platform for cyberbullying with 45% of UK parents identifying Facebook as the most common site for it. Parenting Through the AI Shift Alongside social challenges like cyberbullying, the rise of AI is reshaping how parents support their children who are online. Many UK parents recognise the upside of AI, with 39% believing AI is beneficial for their children’s learning and creativity. Optimism is particularly strong among younger parents, with 55% of Gen Z and 51% of Millennials respectively seeing the benefits. Nevertheless, many UK parents remain concerned about their children’s interaction with AI. Over one in three (38%) of UK parents have noticed their child using AI for companionship or emotional support. Almost half (45%) say they have not seen it happen but would be worried if they did. In addition, 59% of parents have initiated conversations with their children about AI-related risks such as deepfakes and misinformation. As children engage with these tools independently, it underscores the need for ongoing conversations, guidance and digital education to help families navigate the evolving online landscape together. “As students grow up in a digital world, school systems need to equip them with the skills to become tech-savvy and cyber resilient. By fostering digital literacy, we empower students to not only use technology effectively, but to excel in their academic, personal, and professional lives,” said Catherine Dunlop, Senior Vice President of Corporate Partnerships at Discovery Education. 5 Tips to Help Keep Kids Safer in a Connected World The Kids on Devices Report underscores that, as children engage with technology earlier and more frequently, it’s essential for parents to stay proactive, informed and involved. Norton recommends the following steps to help create a safer and more supportive digital experience for kids: For access to full results of the 2025 Norton Cyber Safety Insights Report: Connected Kids, please visit https://newsroom.gendigital.com/Norton-Cyber-Safety-Insights-Report-Connected-Kids About the 2025 Norton Cyber Safety Insights Report The study was conducted online within the United Kingdom by Dynata on behalf of Gen from 24 th April to 8 th May 2025 among 1,000 adults ages 18 and older. Data are weighted where necessary by age, gender, and region, to be nationally representative. Within this report, mentions of parents refer to parents with children younger than 18 years old. About Norton Norton is a leader in Cyber Safety, and part of Gen (NASDAQ: GEN), a global company dedicated to powering Digital Freedom with a family of trusted consumer brands. Norton empowers millions of individuals and families with award-winning protection for their devices, online privacy and identity. Norton products and services are certified by independent testing organizations including AV-TEST, AV-Comparatives, and SE Labs. Norton is a founding member of the Coalition Against Stalkerware. Learn more at www.norton.com . * Parents refers to parents with children under the age of 18. Please follow and like us: Please follow and like us: Author Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd Views: 59"
    },
    {
        "source": "Technology Reseller",
        "url": "https://technologyreseller.uk/exertis-enterprise-continuing-our-commitment-to-specialist-distribution-with-pride-and-purpose/",
        "date": "29-07-2025",
        "title": "Exertis Enterprise: Continuing Our Commitment to Specialist Distribution with Pride and Purpose",
        "cleaned_text": "Exertis Enterprise is pleased to acknowledge the strategic announcement made by DCC Technology regarding the sale of Exertis UK & Ireland and its subsidiaries to AURELIUS. While we congratulate Exertis UK on this milestone, we want to take this opportunity to reaffirm our continued focus on delivering exceptional, specialized solutions for our customers and partners. Exertis Enterprise is not part of this transaction and remains an integral, independent division of DCC Technology. Our mission continues as it always has — delivering tailored, outcome-driven solutions across servers, storage, components, networking, infrastructure, and cybersecurity . We help customers successfully navigate the fast-evolving IT landscape, providing expert guidance and high-quality, specialized distribution. As part of our ongoing journey, Exertis Enterprise will also be evolving under a new identity in the coming months. This transition will mark a renewal of our focus on technical excellence, innovation, and a customer-first approach, reaffirming our dedication to providing best-in-class solutions to our partners and customers. We look forward to sharing more details of this evolution in the near future. Jason Chibnall , Managing Director of Exertis Enterprise, said: “Today’s announcement reinforces the unique path Exertis Enterprise has followed within DCC Technology. We remain committed to the same values that have always defined our approach: delivering specialist solutions that drive tangible business outcomes for our customers and partners. Our focus remains on providing technical expertise and a personal, solutions-led approach that sets us apart in the distribution market.” With our extensive expertise in enterprise IT and emerging technologies like AI and hybrid cloud , Exertis Enterprise continues to provide resellers, MSPs, and integrators with the tools they need to succeed. Our focus remains on delivering tailored solutions that go far beyond the transactional, empowering our partners to scale and innovate in today’s rapidly changing IT environment. Tom Cox , Director of Sales UK, added: “Exertis Enterprise is more than just a distributor — we’re trusted partners to our customers. They don’t come to us for a catalogue; they come to us for insight, solutions, and results. We are proud of the relationships we’ve built, and we remain committed to providing exceptional service and value.” As part of DCC Technology’s strategic focus on Pro Tech, Exertis Enterprise continues to play a central role in offering unmatched value through specialized distribution. Our renewed focus will bring even greater benefits to our customers and partners, ensuring that we remain at the forefront of the enterprise IT landscape. Exertis Enterprise remains committed to delivering outcome-driven solutions , exceptional customer service, and specialized expertise in every aspect of our business. As we continue to evolve, our partners and customers can expect the same high level of support, value, and trust they’ve come to rely on, now with a strengthened focus on specialist distribution excellence . We thank you for your ongoing support and look forward to continuing our partnership in the years to come. To find out more, visit: www.exertisenterprise.com Please follow and like us: Please follow and like us: Author Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd View all posts Neil Trim Publishing Director of Kingswood Media Ltd Views: 262"
    },
    {
        "source": "UC Today",
        "url": "https://www.uctoday.com/unified-communications/cpaas/casa25-where-the-future-of-cpaas-takes-centre-stage-in-amsterdam/",
        "date": "29-07-2025",
        "title": "CASA25: Where the Future of CPaaS Takes Centre Stage in Amsterdam",
        "cleaned_text": "CASA25, the CPaaS Acceleration Summit, returns this September with a sharper focus, smarter conversations, and serious momentum behind the programmable communications movement In an era where programmable communications are wholly rewriting enterprise playbooks, CASA25 lands in Amsterdam at just the right moment. From 22–24 September 2025 , this three‑day summit draws together telcos, platform builders, API pioneers and CX strategists; not for staged presentations, but for deep collaboration. If you’re driving CPaaS strategy, from architecture and automation to go‑to‑market growth, CASA25 is where you sharpen your edge. CASA25 is Where Strategy Meets Substance Returning to Amsterdam following two sold‑out editions, now at the city’s Tobacco Theater , CASA25 has evolved well beyond a conference and into a curated ecosystem of impact. Over three packed days, attendees will dive into design‑sprint workshops, C‑level panels, and the highly anticipated public premiere of the State of CPaaS 2025 report and its Intelligent Engagement North Star, a practical field guide built for revenue‑ready, AI‑infused communications. Expect a balanced mix of hands‑on sessions and strategic dialogue, covering topics such as telco‑led Network API monetization, bridging UCaaS/CCaaS with composable CPaaS, and Gen AI powering customer and employee experience. Sponsors and speakers will be drawn from firms like Gamma, Sinch, Infobip, Radisys, GSMA, CM.com, KPN, Vonage, STL Partners, and more. The content will be rooted in real, tangible use cases, centring not on hype but on insight. By the end of the day, attendees will walk away with new frameworks, vetted partnerships, and the confidence to lead their organizations toward a $100 billion+ CPaaS future. Why CPaaS in 2025 Demands Attention from Leaders The stage of experimental CPaaS is well and truly over. It’s go‑time. In 2025, programmable comms extends beyond APIs and is fundamentally about blending AI, network orchestration, and real‑time engagement across channels. For enterprise tech buyers, from CIOs and CTOs to procurement committees, the critical questions now are: How do we scale with control? How do we align with evolving regulation and reliability? How do we make CPaaS central to CX, EX, and transformation agendas? This summit addresses those questions head‑on. The Intelligent Engagement concept, unveiled at CASA25, reframes CPaaS as a business‑critical asset, embedding AI, automation, and orchestration into revenue‑ready customer journeys. The State of CPaaS 2025 report offers hard data, trend mapping and visionary frameworks to help leaders move beyond tactical deployments to strategic integration. Meanwhile, service providers and CPaaS platforms face mounting expectations, from seamless UCaaS/CCaaS convergence to compliance, customization, and global delivery. CASA25 enables both sides of the ecosystem to align around real outcomes rather than just flashy features. If you’re building, selling, buying or deploying programmable communications, Casa 25 is the one event you don’t want to miss this year. Three days in Amsterdam, big ideas, real-world context, and the right people in the room. Explore the agenda and register now at casa25.amsterdam ."
    }
]